outputs/joined.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFicheroXML</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:86b2f8e8-0335-4a95-8e30-ef97c9f57d83</wsa:MessageID><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFicheroXML</wsa:To><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
            <wsse:BinarySecurityToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509Certificate">
            </wsse:BinarySecurityToken>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#" Id="Signature-2117099736">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                    </CanonicalizationMethod>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#idBody">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                                <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                            </Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue/>
                    </Reference>
                    <Reference URI="#idTimestampToken">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                                <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                            </Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue/>
                    </Reference>
                </SignedInfo>
                <SignatureValue/>
                <KeyInfo>
                    <KeyValue/>
                </KeyInfo>
            </Signature>
        </wsse:Security>
    </soap-env:Header>
  <soap-env:Body>
    <ns0:envioFicheroXML xmlns:ns0="https://ws.negocio.registroHostelero.a19.gvdi.com">
      <ns0:cabecera>
        <aplicacion>Cloudbeds integration</aplicacion>
        <codigoArrendador>B20805578</codigoArrendador>
        <tipoComunicacion>PV</tipoComunicacion>
      </ns0:cabecera>
      <ns0:solicitud>&lt;![CDATA[&lt;alt:peticion xmlns:alt="http://www.servicios.ertzaintza.eus/Ertzaintza/ALOJADOS/A19/comunicacionPV"&gt;
&lt;solicitud&gt;
  &lt;codigoEstablecimiento&gt;C1123&lt;/codigoEstablecimiento&gt;
  &lt;comunicacion&gt;
    &lt;establecimiento&gt;
      &lt;codigoEstablecimiento&gt;C1123&lt;/codigoEstablecimiento&gt;
      &lt;datosEstablecimiento&gt;
        &lt;tipo&gt;albergue&lt;/tipo&gt;
        &lt;nombre&gt;BLAI BLAI ATERPETXEA BSS00029&lt;/nombre&gt;
        &lt;direccion&gt;
          &lt;direccion&gt;NAFARROA CALLE 37 A&lt;/direccion&gt;
          &lt;direccion2&gt;BA&lt;/direccion2&gt;
          &lt;localidad&gt;Zarautz&lt;/localidad&gt;
          &lt;provincia&gt;Gipuzkoa&lt;/provincia&gt;
          &lt;codigoPostal&gt;48901&lt;/codigoPostal&gt;
          &lt;pais&gt;ESP&lt;/pais&gt;
        &lt;/direccion&gt;
      &lt;/datosEstablecimiento&gt;
    &lt;/establecimiento&gt;
    &lt;contrato&gt;
      &lt;referencia&gt;B20805578-1&lt;/referencia&gt;
      &lt;fechaContrato&gt;2022-09-29&lt;/fechaContrato&gt;
      &lt;fechaEntrada&gt;2022-09-19T01:18:33&lt;/fechaEntrada&gt;
      &lt;fechaSalida&gt;2022-09-21T19:27:14+02:00&lt;/fechaSalida&gt;
      &lt;numPersonas&gt;2&lt;/numPersonas&gt;
      &lt;numHabitaciones&gt;1&lt;/numHabitaciones&gt;
      &lt;internet&gt;true&lt;/internet&gt;
      &lt;pago&gt;
        &lt;tipoPago&gt;EFECT&lt;/tipoPago&gt;
        &lt;fechaPago&gt;2022-09-29&lt;/fechaPago&gt;
      &lt;/pago&gt;
    &lt;/contrato&gt;
    &lt;persona&gt;
      &lt;item&gt;
        &lt;rol&gt;TI&lt;/rol&gt;
        &lt;nombre&gt;Juan&lt;/nombre&gt;
        &lt;apellido1&gt;Perez&lt;/apellido1&gt;
        &lt;apellido2&gt;Gomez&lt;/apellido2&gt;
        &lt;tipoDocumento&gt;DNI&lt;/tipoDocumento&gt;
        &lt;numeroDocumento&gt;12345678&lt;/numeroDocumento&gt;
        &lt;soporteDocumento&gt;DNI&lt;/soporteDocumento&gt;
        &lt;fechaNacimiento&gt;1956-05-02&lt;/fechaNacimiento&gt;
        &lt;nacionalidad&gt;ES&lt;/nacionalidad&gt;
        &lt;sexo&gt;H&lt;/sexo&gt;
        &lt;direccion&gt;
          &lt;direccion&gt;Paseo de las Camelias 456&lt;/direccion&gt;
          &lt;direccion2&gt;Retorno de los Laureles&lt;/direccion2&gt;
          &lt;localidad&gt;Zaragoza&lt;/localidad&gt;
          &lt;provincia&gt;Zaragoza&lt;/provincia&gt;
          &lt;codigoPostal&gt;50012&lt;/codigoPostal&gt;
          &lt;pais&gt;ES&lt;/pais&gt;
        &lt;/direccion&gt;
        &lt;telefono&gt;777777777&lt;/telefono&gt;
        &lt;telefono2&gt;777777777&lt;/telefono2&gt;
        &lt;correo&gt;person1@example.com&lt;/correo&gt;
        &lt;parentesco/&gt;
      &lt;/item&gt;
      &lt;item&gt;
        &lt;rol&gt;VI&lt;/rol&gt;
        &lt;nombre&gt;Eliseo&lt;/nombre&gt;
        &lt;apellido1&gt;Perez&lt;/apellido1&gt;
        &lt;apellido2&gt;Campa&lt;/apellido2&gt;
        &lt;tipoDocumento&gt;DNI&lt;/tipoDocumento&gt;
        &lt;numeroDocumento&gt;12345679&lt;/numeroDocumento&gt;
        &lt;soporteDocumento&gt;DNI&lt;/soporteDocumento&gt;
        &lt;fechaNacimiento&gt;1986-02-09&lt;/fechaNacimiento&gt;
        &lt;nacionalidad&gt;ES&lt;/nacionalidad&gt;
        &lt;sexo&gt;H&lt;/sexo&gt;
        &lt;direccion&gt;
          &lt;direccion&gt;Paseo de las Camelias 456&lt;/direccion&gt;
          &lt;direccion2&gt;Retorno de los Laureles&lt;/direccion2&gt;
          &lt;localidad&gt;Zaragoza&lt;/localidad&gt;
          &lt;provincia&gt;Zaragoza&lt;/provincia&gt;
          &lt;codigoPostal&gt;50012&lt;/codigoPostal&gt;
          &lt;pais&gt;ES&lt;/pais&gt;
        &lt;/direccion&gt;
        &lt;telefono&gt;777777777&lt;/telefono&gt;
        &lt;telefono2&gt;777777777&lt;/telefono2&gt;
        &lt;correo&gt;person2@example.com&lt;/correo&gt;
        &lt;parentesco&gt;12&lt;/parentesco&gt;
      &lt;/item&gt;
    &lt;/persona&gt;
  &lt;/comunicacion&gt;
&lt;/solicitud&gt;

&lt;/alt:peticion&gt;]]&gt;</ns0:solicitud>
    </ns0:envioFicheroXML>
  </soap-env:Body>
</soap-env:Envelope>
